melvinf1team/pmsm-temperature-prediction-stm32/firmware_acquisition/tets_motor_dewalt/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"
#include "motorcontrol.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Start_Stop_Pin GPIO_PIN_13
#define Start_Stop_GPIO_Port GPIOC
#define Start_Stop_EXTI_IRQn EXTI15_10_IRQn
#define M1_CURR_SHUNT_U_AND_SHUNT_P_U_Pin GPIO_PIN_0
#define M1_CURR_SHUNT_U_AND_SHUNT_P_U_GPIO_Port GPIOB
#define M1_CURR_AMP_U_Pin GPIO_PIN_1
#define M1_CURR_AMP_U_GPIO_Port GPIOB
#define M1_SHUNT_M_U_Pin GPIO_PIN_2
#define M1_SHUNT_M_U_GPIO_Port GPIOB
#define M1_VOLT_V_Pin GPIO_PIN_12
#define M1_VOLT_V_GPIO_Port GPIOE
#define M1_TEMPERATURE_Pin GPIO_PIN_15
#define M1_TEMPERATURE_GPIO_Port GPIOE
#define M1_SHUNT_M_V_Pin GPIO_PIN_10
#define M1_SHUNT_M_V_GPIO_Port GPIOB
#define M1_CURR_SHUNT_V_AND_SHUNT_P_V_Pin GPIO_PIN_11
#define M1_CURR_SHUNT_V_AND_SHUNT_P_V_GPIO_Port GPIOB
#define M1_CURR_AMP_V_Pin GPIO_PIN_12
#define M1_CURR_AMP_V_GPIO_Port GPIOB
#define M1_BUS_VOLTAGE_Pin GPIO_PIN_13
#define M1_BUS_VOLTAGE_GPIO_Port GPIOB
#define M1_CURR_SHUNT_W_AND_SHUNT_P_W_Pin GPIO_PIN_14
#define M1_CURR_SHUNT_W_AND_SHUNT_P_W_GPIO_Port GPIOB
#define M1_SHUNT_M_W_Pin GPIO_PIN_15
#define M1_SHUNT_M_W_GPIO_Port GPIOB
#define M1_VOLT_U_Pin GPIO_PIN_10
#define M1_VOLT_U_GPIO_Port GPIOD
#define M1_CURR_U_Pin GPIO_PIN_11
#define M1_CURR_U_GPIO_Port GPIOD
#define M1_CURR_V_Pin GPIO_PIN_12
#define M1_CURR_V_GPIO_Port GPIOD
#define M1_VOLT_W_Pin GPIO_PIN_13
#define M1_VOLT_W_GPIO_Port GPIOD
#define M1_CURR_W_Pin GPIO_PIN_14
#define M1_CURR_W_GPIO_Port GPIOD
#define M1_PWM_UH_Pin GPIO_PIN_6
#define M1_PWM_UH_GPIO_Port GPIOC
#define M1_PWM_VH_Pin GPIO_PIN_7
#define M1_PWM_VH_GPIO_Port GPIOC
#define M1_PWM_WH_Pin GPIO_PIN_8
#define M1_PWM_WH_GPIO_Port GPIOC
#define M1_CURR_AMP_W_Pin GPIO_PIN_8
#define M1_CURR_AMP_W_GPIO_Port GPIOA
#define UART_RX_Pin GPIO_PIN_10
#define UART_RX_GPIO_Port GPIOA
#define M1_PWM_UL_Pin GPIO_PIN_10
#define M1_PWM_UL_GPIO_Port GPIOC
#define M1_PWM_VL_Pin GPIO_PIN_11
#define M1_PWM_VL_GPIO_Port GPIOC
#define M1_PWM_WL_Pin GPIO_PIN_12
#define M1_PWM_WL_GPIO_Port GPIOC
#define DS18B20_DQ_Pin GPIO_PIN_6
#define DS18B20_DQ_GPIO_Port GPIOG
#define M1_EN_DRIVER_Pin GPIO_PIN_7
#define M1_EN_DRIVER_GPIO_Port GPIOG
#define UART_TX_Pin GPIO_PIN_9
#define UART_TX_GPIO_Port GPIOG
#define M1_DP_Pin GPIO_PIN_7
#define M1_DP_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
